# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Apps
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'microsoft-edge'
cask 'slack'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Core
brew 'coreutils'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'jq'
brew 'mas'
brew 'mkcert'
brew 'telnet'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# DevOps
brew 'argocd'
brew 'awscli'
brew 'fluxctl'
brew 'helm'
brew 'istioctl'
brew 'kpt'
brew 'kubeadm'
brew 'kubecfg'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubeseal'
brew 'kustomize'
brew 'pgcli'
brew 'rke'
brew 'sops'

# Fonts
cask 'font-fira-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'

# Mac App Store
mas 'Magnet', id: 441258766
mas 'LastPass', id: 926036361